GopalSaraf/Practicals/PSDL/include/proc/pic16f18054.h
extern volatile PR3bits_t PR3bits __at(0x295);
// bitfield macros
#define _PR3_GVAL_POSN                                      0x2
#define _PR3_GVAL_POSITION                                  0x2
#define _PR3_GVAL_SIZE                                      0x1
#define _PR3_GVAL_LENGTH                                    0x1
#define _PR3_GVAL_MASK                                      0x4
#define _PR3_GGO_nDONE_POSN                                 0x3
#define _PR3_GGO_nDONE_POSITION                             0x3
#define _PR3_GGO_nDONE_SIZE                                 0x1
#define _PR3_GGO_nDONE_LENGTH                               0x1
#define _PR3_GGO_nDONE_MASK                                 0x8
#define _PR3_GSPM_POSN                                      0x4
#define _PR3_GSPM_POSITION                                  0x4
#define _PR3_GSPM_SIZE                                      0x1
#define _PR3_GSPM_LENGTH                                    0x1
#define _PR3_GSPM_MASK                                      0x10
#define _PR3_GTM_POSN                                       0x5
#define _PR3_GTM_POSITION                                   0x5
#define _PR3_GTM_SIZE                                       0x1
#define _PR3_GTM_LENGTH                                     0x1
#define _PR3_GTM_MASK                                       0x20
#define _PR3_GPOL_POSN                                      0x6
#define _PR3_GPOL_POSITION                                  0x6
#define _PR3_GPOL_SIZE                                      0x1
#define _PR3_GPOL_LENGTH                                    0x1
#define _PR3_GPOL_MASK                                      0x40
#define _PR3_GE_POSN                                        0x7
#define _PR3_GE_POSITION                                    0x7
#define _PR3_GE_SIZE                                        0x1
#define _PR3_GE_LENGTH                                      0x1
#define _PR3_GE_MASK                                        0x80
#define _PR3_T3GVAL_POSN                                    0x2
#define _PR3_T3GVAL_POSITION                                0x2
#define _PR3_T3GVAL_SIZE                                    0x1
#define _PR3_T3GVAL_LENGTH                                  0x1
#define _PR3_T3GVAL_MASK                                    0x4
#define _PR3_T3GGO_nDONE_POSN                               0x3
#define _PR3_T3GGO_nDONE_POSITION                           0x3
#define _PR3_T3GGO_nDONE_SIZE                               0x1
#define _PR3_T3GGO_nDONE_LENGTH                             0x1
#define _PR3_T3GGO_nDONE_MASK                               0x8
#define _PR3_T3GSPM_POSN                                    0x4
#define _PR3_T3GSPM_POSITION                                0x4
#define _PR3_T3GSPM_SIZE                                    0x1
#define _PR3_T3GSPM_LENGTH                                  0x1
#define _PR3_T3GSPM_MASK                                    0x10
#define _PR3_T3GTM_POSN                                     0x5
#define _PR3_T3GTM_POSITION                                 0x5
#define _PR3_T3GTM_SIZE                                     0x1
#define _PR3_T3GTM_LENGTH                                   0x1
#define _PR3_T3GTM_MASK                                     0x20
#define _PR3_T3GPOL_POSN                                    0x6
#define _PR3_T3GPOL_POSITION                                0x6
#define _PR3_T3GPOL_SIZE                                    0x1
#define _PR3_T3GPOL_LENGTH                                  0x1
#define _PR3_T3GPOL_MASK                                    0x40
#define _PR3_T3GE_POSN                                      0x7
#define _PR3_T3GE_POSITION                                  0x7
#define _PR3_T3GE_SIZE                                      0x1
#define _PR3_T3GE_LENGTH                                    0x1
#define _PR3_T3GE_MASK                                      0x80
#define _PR3_T3GGO_POSN                                     0x3
#define _PR3_T3GGO_POSITION                                 0x3
#define _PR3_T3GGO_SIZE                                     0x1
#define _PR3_T3GGO_LENGTH                                   0x1
#define _PR3_T3GGO_MASK                                     0x8

// Register: T3GATE
#define T3GATE T3GATE
extern volatile unsigned char           T3GATE              __at(0x296);
#ifndef _LIB_BUILD
asm("T3GATE equ 0296h");
#endif
// aliases
extern volatile unsigned char           TMR3GATE            __at(0x296);
#ifndef _LIB_BUILD
asm("TMR3GATE equ 0296h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned GSS                    :5;
    };
    struct {
        unsigned GSS0                   :1;
        unsigned GSS1                   :1;
        unsigned GSS2                   :1;
        unsigned GSS3                   :1;
        unsigned GSS4                   :1;
    };
    struct {
        unsigned T3GSS0                 :1;
        unsigned T3GSS1                 :1;
        unsigned T3GSS2                 :1;
        unsigned T3GSS3                 :1;
        unsigned T3GSS4                 :1;
    };
} T3GATEbits_t;
extern volatile T3GATEbits_t T3GATEbits __at(0x296);
// bitfield macros
#define _T3GATE_GSS_POSN                                    0x0
#define _T3GATE_GSS_POSITION                                0x0
#define _T3GATE_GSS_SIZE                                    0x5
#define _T3GATE_GSS_LENGTH                                  0x5
#define _T3GATE_GSS_MASK                                    0x1F
#define _T3GATE_GSS0_POSN                                   0x0
#define _T3GATE_GSS0_POSITION                               0x0
#define _T3GATE_GSS0_SIZE                                   0x1
#define _T3GATE_GSS0_LENGTH                                 0x1
#define _T3GATE_GSS0_MASK                                   0x1
#define _T3GATE_GSS1_POSN                                   0x1
#define _T3GATE_GSS1_POSITION                               0x1
#define _T3GATE_GSS1_SIZE                                   0x1
#define _T3GATE_GSS1_LENGTH                                 0x1
#define _T3GATE_GSS1_MASK                                   0x2
#define _T3GATE_GSS2_POSN                                   0x2
#define _T3GATE_GSS2_POSITION                               0x2
#define _T3GATE_GSS2_SIZE                                   0x1
#define _T3GATE_GSS2_LENGTH                                 0x1
#define _T3GATE_GSS2_MASK                                   0x4
#define _T3GATE_GSS3_POSN                                   0x3
#define _T3GATE_GSS3_POSITION                               0x3
#define _T3GATE_GSS3_SIZE                                   0x1
#define _T3GATE_GSS3_LENGTH                                 0x1
#define _T3GATE_GSS3_MASK                                   0x8
#define _T3GATE_GSS4_POSN                                   0x4
#define _T3GATE_GSS4_POSITION                               0x4
#define _T3GATE_GSS4_SIZE                                   0x1
#define _T3GATE_GSS4_LENGTH                                 0x1
#define _T3GATE_GSS4_MASK                                   0x10
#define _T3GATE_T3GSS0_POSN                                 0x0
#define _T3GATE_T3GSS0_POSITION                             0x0
#define _T3GATE_T3GSS0_SIZE                                 0x1
#define _T3GATE_T3GSS0_LENGTH                               0x1
#define _T3GATE_T3GSS0_MASK                                 0x1
#define _T3GATE_T3GSS1_POSN                                 0x1
#define _T3GATE_T3GSS1_POSITION                             0x1
#define _T3GATE_T3GSS1_SIZE                                 0x1
#define _T3GATE_T3GSS1_LENGTH                               0x1
#define _T3GATE_T3GSS1_MASK                                 0x2
#define _T3GATE_T3GSS2_POSN                                 0x2
#define _T3GATE_T3GSS2_POSITION                             0x2
#define _T3GATE_T3GSS2_SIZE                                 0x1
#define _T3GATE_T3GSS2_LENGTH                               0x1
#define _T3GATE_T3GSS2_MASK                                 0x4
#define _T3GATE_T3GSS3_POSN                                 0x3
#define _T3GATE_T3GSS3_POSITION                             0x3
#define _T3GATE_T3GSS3_SIZE                                 0x1
#define _T3GATE_T3GSS3_LENGTH                               0x1
#define _T3GATE_T3GSS3_MASK                                 0x8
#define _T3GATE_T3GSS4_POSN                                 0x4
#define _T3GATE_T3GSS4_POSITION                             0x4
#define _T3GATE_T3GSS4_SIZE                                 0x1
#define _T3GATE_T3GSS4_LENGTH                               0x1
#define _T3GATE_T3GSS4_MASK                                 0x10
// alias bitfield definitions
typedef union {
    struct {
        unsigned GSS                    :5;
    };
    struct {
        unsigned GSS0                   :1;
        unsigned GSS1                   :1;
        unsigned GSS2                   :1;
        unsigned GSS3                   :1;
        unsigned GSS4                   :1;
    };
    struct {
        unsigned T3GSS0                 :1;
        unsigned T3GSS1                 :1;
        unsigned T3GSS2                 :1;
        unsigned T3GSS3                 :1;
        unsigned T3GSS4                 :1;
    };
} TMR3GATEbits_t;
